#各种容器的底层实现
STL中的容器主要包括：vector、dequeue、list、set、map、unorder_set、unorder_map。  
由此衍生出的容器适配器：stack、queue、priority_queue。所谓容器适配器是指我们利用定义的STL中的容器进行再次封装，使之提供给我们的接口满足我们日常所用的数据结构：栈、队列和优先级队列。  
其中栈，队列是在dequeue基础上实现的，优先级队列则是在vector上实现的。  

##各种容器的底层实现  
vector：一块连续的内存空间，当元素的增长超过capacity时，开辟一块更大的内存空间，将元素在拷贝过来，每次增长的大小为原来的两倍。分配的空间是在堆中。  
dequeue(双端队列):多块不连续的内存空间连接而成，小的内存空间是在堆中开辟的，每个小的内存空间可以保存多个元素。它们之间用指针相连。  
list(双向链表):也是在堆中分配空间，每个空间保存一个元素，空间与空间之间用指针相连。  
set:在堆中分配空间，底层的数据结构是一种称为红黑树的平衡二叉树。  
map：也是在堆中分配空间，底层是树型结构，多数是平衡二叉树。  
unorder_set,unorder_map:多块不连续的内存空间，每个内存空间我们称之为桶，桶与桶之间用指针相连。对于元素的映射，利用一个hash函数实现，每个桶可以保存多个元素。  
